[{"bill_id": "hr6063-110", "title": "To authorize the programs of the National Aeronautics and Space Administration, and for other purposes.", "summary": "National Aeronautics and Space Administration Authorization Act of 2008 - Title I: Authorization of Appropriations for Fiscal Year 2009 - (Sec. 101) Authorizes appropriations to the National Aeronautics and Space Administration (NASA) for FY2009 for: (1) science; (2) aeronautics; (3) exploration; (4) education; (5) space operations; (6) cross-agency support programs; and (7) the inspector general. Title II: Earth Science - (Sec. 201) Declares that the goal for NASA's Earth Science program sha..."}, {"bill_id": "hr2407-110", "title": "To establish the National Hurricane Research Initiative to improve hurricane preparedness, and for other purposes.", "summary": "National Hurricane Research Initiative Act of 2007 - Requires the Under Secretary for Oceans and Atmosphere of the Department of Commerce and the Director of the National Science Foundation (NSF) to establish a National Hurricane Research Initiative and to cooperate with other specified federal agencies to carry it out. Requires such Initiative to set research objectives (based on a National Science Board report on the need for such Initiative) to: (1) make recommendations to the Board and to..."}, {"bill_id": "s255-110", "title": "A bill to provide assistance to the State of New Mexico for the development of comprehensive State water plans, and for other purposes.", "summary": "New Mexico Water Planning Assistance Act - Directs the Secretary of the Interior, at the request of the governor of New Mexico and acting through the Bureau of Reclamation and the U.S. Geological Survey, to: (1) provide to New Mexico technical assistance and grants for the development of comprehensive state water plans; (2) conduct water resources mapping in New Mexico; and (3) conduct a comprehensive study of groundwater resources in New Mexico to assess the quantity, quality, and interactio..."}, {"bill_id": "hr1904-110", "title": "To provide assistance to the State of New Mexico for the development of comprehensive State water plans, and for other purposes.", "summary": "New Mexico Water Planning Assistance Act - Directs the Secretary of the Interior, at the request of the governor of New Mexico and acting through the Bureau of Reclamation and the U.S. Geological Survey (USGS), to: (1) provide to New Mexico technical assistance and grants for the development of comprehensive state water plans; (2) conduct water resources mapping in New Mexico; and (3) conduct a comprehensive study of groundwater resources in New Mexico to assess the quantity, quality, and int..."}, {"bill_id": "s2307-110", "title": "A bill to amend the Global Change Research Act of 1990, and for other purposes.", "summary": "Global Change Research Improvement Act of 2007 [sic]- Title I: Amendment of the Global Change Research Act of 1990 - (Sec. 103) Amends the Global Change Research Act of 1990 to: (1) rename the Committee on Earth and Environmental Sciences as the Committee on Global Change Research; and (2) replace the Federal Coordinating Council on Science, Engineering, and Technology with the National Science and Technology Council established by Executive Order 12881, November 23, 1993. Defines \"global cha..."}, {"bill_id": "hr21-110", "title": "To establish a national policy for our oceans, to strengthen the National Oceanic and Atmospheric Administration, to establish a national and regional ocean governance structure, and for other purposes.", "summary": "Oceans Conservation, Education, and National Strategy for the 21st Century Act - Establishes a national policy to protect, maintain, and restore the health of marine ecosystems and requires that federal agencies administer U.S. policies and laws accordingly. Allows more stringent federal and state requirements. States that there shall be an agency known as the National Oceanic and Atmospheric Administration (NOAA), declares that Reorganization Plan No. 4 of 1970 (concerning NOAA) shall have n..."}, {"bill_id": "hr4612-110", "title": "To amend the Internal Revenue Code of 1986 to provide an investment credit for electric generation facilities with climate neutral combustion.", "summary": "Climate Neutral Electricity Generation Act of 2007 - Amends the Internal Revenue Code to allow a tax credit for investment in a climate neutral combustion facility. Defines \"climate neutral combustion facility\" as any facility which: (1) burns matter to produce electricity; (2) captures and uses carbon dioxide released during combustion to recover hydrocarbon fuel; and (3) produces no emissions of mercury or greenhouse gasses and no emissions that form fine particulate, smog, or acid rain"}, {"bill_id": "s950-110", "title": "A bill to develop and maintain an integrated system of coastal and ocean observations for the Nation's coasts, oceans, and Great Lakes, to improve warnings of tsunami, hurricanes, El Nino events, and other natural hazards, to enhance homeland security, to support maritime operations, to improve management of coastal and marine resources, and for other purposes.", "summary": "Coastal and Ocean Observation System Act of 2007 - (Sec. 4) Directs the President, acting through the National Ocean Research Leadership Council, to establish and maintain an integrated system of coastal and ocean observations, data communication and management, analysis, modeling, research, education, and outreach for the timely detection and prediction of changes occurring in the ocean, coastal, and Great Lakes environments that impact the nation's social, economic, and ecological systems. ..."}, {"bill_id": "hr1832-110", "title": "To establish the National Hurricane Research Initiative to improve hurricane preparedness, and for other purposes.", "summary": "National Hurricane Research Initiative Act of 2007 - Requires the Under Secretary for Oceans and Atmosphere of the Department of Commerce and the Director of the National Science Foundation (NSF) to establish a National Hurricane Research Initiative and to cooperate with other specified federal agencies to carry it out. Requires such Initiative to set research objectives (based on a National Science Board report on the need for such Initiative) to: (1) make recommendations to the Board; (2) a..."}, {"bill_id": "s931-110", "title": "A bill to establish the National Hurricane Research Initiative to improve hurricane preparedness, and for other purposes.", "summary": "National Hurricane Research Initiative Act of 2007 - Requires the Under Secretary for Oceans and Atmosphere of the Department of Commerce and the Director of the National Science Foundation (NSF) to establish a National Hurricane Research Initiative and to cooperate with other specified federal agencies to carry it out. Requires such Initiative to set research objectives (based on a National Science Board report on the need for such Initiative) to: (1) make recommendations to the Board; (2) a..."}, {"bill_id": "hr250-110", "title": "To provide for the National Oceanic and Atmospheric Administration, and for other purposes.", "summary": "National Oceanic and Atmospheric Administration Act - Reestablishes in the Department of Commerce the National Oceanic and Atmospheric Administration (NOAA), headed by an Under Secretary of Commerce for Oceans and Atmosphere, who shall serve as the Administrator of NOAA. Maintains within NOAA: (1) the National Weather Service; (2) programs to support efforts, on a continuing basis, to collect data and provide information and products regarding satellites, observations, and coastal, ocean, and..."}, {"bill_id": "hr1711-109", "title": "To provide assistance to the State of New Mexico for the development of comprehensive State water plans, and for other purposes.", "summary": "New Mexico Water Planning Assistance Act - Directs the Secretary of the Interior, at the request of the Governor of New Mexico and acting through the Bureau of Reclamation and the U.S. Geological Survey, to: (1) provide to New Mexico technical assistance and grants for the development of comprehensive state water plans; (2) conduct water resources mapping in New Mexico; and (3) conduct a comprehensive study of groundwater resources in New Mexico to assess the quantity, quality, and interactio..."}, {"bill_id": "s4005-109", "title": "A bill to establish the National Hurricane Research Initiative to improve hurricane preparedness, and for other purposes.", "summary": "National Hurricane Research Initiative Act of 2006 - Requires the Under Secretary for Oceans and Atmosphere of the Department of Commerce and the Director of the National Science Foundation (NSF) to establish a National Hurricane Research Initiative and to cooperate with other specified federal agencies to carry it out. Requires such Initiative to set research objectives (based on a National Science Board report on the need for such Initiative) to: (1) make recommendations to the Board; (2) a..."}, {"bill_id": "hr5450-109", "title": "To provide for the National Oceanic and Atmospheric Administration, and for other purposes.", "summary": "National Oceanic and Atmospheric Administration Act - (Sec. 3) Reestablishes in the Department of Commerce the National Oceanic and Atmospheric Administration (NOAA), headed by an Under Secretary of Commerce for Oceans and Atmosphere, who shall serve as the Administrator of NOAA. Establishes within NOAA the positions of: (1) Assistant Secretary of Commerce for Oceans and Atmosphere; (2) Deputy Under Secretary of Commerce for Oceans and Atmosphere; (3) Deputy Assistant Secretary for Science an..."}, {"bill_id": "hr5149-109", "title": "To maintain the rural heritage of the Eastern Sierra and enhance the region's tourism economy by designating certain public lands as wilderness and certain rivers as wild and scenic rivers in the State of California, and for other purposes.", "summary": "Eastern Sierra Rural Heritage and Economic Enhancement Act - Designates as wilderness areas and components of the National Wilderness Preservation System certain lands in the Humboldt-Toiyabe National Forest, which shall be deemed part of the Hoover Wilderness and Emigrant Wilderness. Authorizes appropriations for management and enforcement of snowmobile use on such lands. Amends the Wild and Scenic Rivers Act to designate specified segments of the the Amargosa River, California, as a compone..."}, {"bill_id": "s2567-109", "title": "A bill to maintain the rural heritage of the Eastern Sierra and enhance the region's tourism economy by designating certain public lands as wilderness and certain rivers as wild a scenic rivers in the State of California, and for other purposes.", "summary": "Eastern Sierra Rural Heritage and Economic Enhancement Act - Designates as wilderness areas and components of the National Wilderness Preservation System certain lands in the Humboldt-Toiyabe National Forest, which shall be deemed part of the Hoover Wilderness and Emigrant Wilderness. Authorizes appropriations for management and enforcement of snowmobile use on such lands. Amends the Wild and Scenic Rivers Act to designate specified segments of the the Amargosa River, California, as a compone..."}, {"bill_id": "hr4288-109", "title": "To amend title 38, United States Code, to provide a presumption of service connection for injuries classified as cold weather injuries which occur in veterans who while engaged in military operations had sustained exposure to cold weather.", "summary": "Veterans Cold Weather Injury Compensation Act - Directs the Secretary of Veterans Affairs to establish and maintain a registry of veterans who, while in active military service, were exposed for a significant period of time to sustained periods of extremely cold weather (seven days or more of average temperatures of 32 degrees or lower). Requires such registry to be used to determine the association, if any, between the disabilities of such veterans and the exposure to such weather.Presumes c..."}, {"bill_id": "s178-109", "title": "A bill to provide assistance to the State of New Mexico for the development of comprehensive State water plans, and for other purposes.", "summary": "New Mexico Water Planning Assistance Act - Directs the Secretary of the Interior, at the request of the Governor of New Mexico and acting through the Bureau of Reclamation and the U.S. Geological Survey, to: (1) provide to New Mexico technical assistance and grants for the development of comprehensive state water plans; (2) conduct water resources mapping in New Mexico; and (3) conduct a comprehensive study of groundwater resources in New Mexico to assess the quantity, quality, and interactio..."}, {"bill_id": "hr3250-109", "title": "To authorize appropriation for the National Aeronautics and Space Administration, and for other purposes.", "summary": "National Aeronautics and Space Administration Authorization Act of 2005 - Authorizes appropriations for FY2006-FY2008 to the National Aeronautics and Space Administration (NASA) for: (1) science, aeronautics, space and flight support, and education; (2) human space flight; and (3) the Office of Inspector General. Reserves certain sums authorized to be appropriated by this Act for innovative technology transfer partnerships and other technology transfer initiatives undertaken by NASA. Requires..."}, {"bill_id": "hr2939-109", "title": "To establish a national policy for our oceans, to strengthen the National Oceanic and Atmospheric Administration, to establish a Committee on Ocean Policy, and for other purposes.", "summary": "Oceans Conservation, Education, and National Strategy for the 21st Century Act - Specifies a national oceans policy. Establishes national standards to require any federal agency or federally funded activities that affect U.S. ocean waters or ocean resources to be conducted in a manner that protects and maintains healthy marine ecosystems and, where appropriate, restores degraded marine ecosystems. Reestablishes in the Department of Commerce (what already exists under Reorganization Plan No. 4..."}]